Tekla Open API Reference for Tekla Structures 2025
Chamfer.ChamferTypeEnum Enumeration
 The basic shape type of the chamfer.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ChamferTypeEnum
Public Enumeration ChamferTypeEnum
Members
Member name | Value | Description
CHAMFER_NONE | 0 |  No chamfer type.
CHAMFER_LINE | 1 |  The line type chamfer.
CHAMFER_ROUNDING | 2 |  The rounding type chamfer.
CHAMFER_ARC | 3 |  The arc type chamfer.
CHAMFER_ARC_POINT | 4 |  The arc point type chamfer.
CHAMFER_SQUARE | 5 |  The square type chamfer.
CHAMFER_SQUARE_PARALLEL | 6 |  The square parallel type chamfer.
CHAMFER_LINE_AND_ARC | 7 |  The line and arc type chamfer.
See Also
Reference
Tekla.Structures.Model Namespace